OpenFOAM_Maincode/tutorials/multiRegion/CHT/multiphaseCoolingCylinder2D/constant/fluid/physicalProperties.oil
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   160;
    }
    equationOfState
    {
        rho         800;
    }
    thermodynamics
    {
        Cv          2000;
        Hf          0;
    }
    transport
    {
        mu          2e-3;
        Pr          100;
    }
}


// ************************************************************************* //
